## Lab 
### *Hasan Ravda [ 216270307028 ]*

## Write a Pandas program to implement following operation

In [1]:
import pandas as pd
import numpy as np

### 1. to find and drop the missing values from the given dataset

In [2]:
dict = {
    'Name':["A","B" ,"C","D"],
    'Maths':[100, 90, None, 95],
 'Science': [30, np.nan, 45, 56]
 }
df=pd.DataFrame(dict)
df

  Name  Maths  Science
0    A  100.0     30.0
1    B   90.0      NaN
2    C    NaN     45.0
3    D   95.0     56.0

In [3]:
print("Dropping the missing values from df : \n")
df.dropna()

Dropping the missing values from df :

  Name  Maths  Science
0    A  100.0     30.0
3    D   95.0     56.0

### 2. to remove the duplicates from the given dataset

In [4]:
df=pd.DataFrame({
    'Name':["A","B" ,"B","C","D","A"],
    'Maths':[100, 90, 90, 80,95,0],
     'Science': [30, 59, 59,45, 56,33]
     })
print("Original df : \n")
df

Original df :

  Name  Maths  Science
0    A    100       30
1    B     90       59
2    B     90       59
3    C     80       45
4    D     95       56
5    A      0       33

In [5]:
df.drop_duplicates()           # By default, it removes duplicate rows based on all columns.

  Name  Maths  Science
0    A    100       30
1    B     90       59
3    C     80       45
4    D     95       56
5    A      0       33

In [6]:
df.drop_duplicates(subset='Name')       # remove duplicates on specific column

  Name  Maths  Science
0    A    100       30
1    B     90       59
3    C     80       45
4    D     95       56